# Relational Database Examples

This Notebook uses the *Titanic - Machine Learning from Disaster* example from Kaggle.com

https://www.kaggle.com/competitions/titanic/data

About Dataset - from the above website (Accessed 09/01/2023):

*The data has been split into two groups:*

    training set (train.csv)
    test set (test.csv)

*The training set should be used to build your machine learning models. For the training set, we provide the outcome (also known as the “ground truth”) for each passenger. Your model will be based on “features” like passengers’ gender and class. You can also use feature engineering to create new features.*

*The test set should be used to see how well your model performs on unseen data. For the test set, we do not provide the ground truth for each passenger. It is your job to predict these outcomes. For each passenger in the test set, use the model you trained to predict whether or not they survived the sinking of the Titanic.*

*We also include gender_submission.csv, a set of predictions that assume all and only female passengers survive, as an example of what a submission file should look like.*

**Data Dictionary**


<pre>
Variable    Definition    Key
survival    Survival      0 = No, 1 = Yes
pclass      Ticket class  1 = 1st, 2 = 2nd, 3 = 3rd
sex         Sex 	
Age         Age in years 	
sibsp       # of siblings / spouses aboard the Titanic 	
parch       # of parents / children aboard the Titanic 	
ticket      Ticket number 	
fare        Passenger fare 	
cabin       Cabin number 	
embarked    Port of Embarkation 	C = Cherbourg, Q = Queenstown, S = Southampton
</pre>

**Variable Notes**

*pclass*: A proxy for socio-economic status (SES)
1st = Upper
2nd = Middle
3rd = Lower

age: Age is fractional if less than 1. If the age is estimated, is it in the form of xx.5

*sibsp*: The dataset defines family relations in this way...
Sibling = brother, sister, stepbrother, stepsister
Spouse = husband, wife (mistresses and fiancés were ignored)

*parch*: The dataset defines family relations in this way...
Parent = mother, father
Child = daughter, son, stepdaughter, stepson
Some children travelled only with a nanny, therefore parch=0 for them.

Enable access to the PostgreSQL database engine via SQL cell magic.

In [1]:
%load_ext sql

Use the sql_init.ipynb file provided by Tutorial 08.2 to login (User tm351)

In [2]:
# Make the connection - this file is available from the Notebooks 08 folder

%run sql_init.ipynb
print("Connecting with connection string : {}".format(DB_CONNECTION))
%sql $DB_CONNECTION

Connecting with connection string : postgresql://tm351:tm351@localhost:5432/tm351

Since this notebook is for demonstration purposes only, start afresh by dropping the tables if they previously existed.

In [3]:
%%sql
DROP TABLE IF EXISTS training;
DROP TABLE IF EXISTS testset;
DROP TABLE IF EXISTS gender_submission;
DROP TABLE IF EXISTS embark;

 * postgresql://tm351:***@localhost:5432/tm351
Done.
Done.
Done.
Done.

Empty DataFrame
Columns: []
Index: []

The Titanic dataset provides three CSV files, we will just use the training and test datasets here. 

*Notebook 08.3 Adding column constraints* to tables shows how we can load these into a Panda DataFrame, then convert to SQL Table. Reading CSV files into a Pandas dataframe is first shown in *Notebook 02.2.1 Data file formats - CSV*

First import pandas:

In [4]:
import pandas as pd

Next import the CSV files into Panda dataframes:

In [5]:
# Import the train.csv file into a DataFrame
training_df=pd.read_csv('data/train.csv')

#Look at the first few rows of the resulting DataFrame
training_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
# Import the test.csv file into a DataFrame
test_df=pd.read_csv('data/test.csv')

#Look at the first few rows of the resulting DataFrame
test_df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [7]:
# Import the gender_submission.csv file into a DataFrame
gender_df=pd.read_csv('data/gender_submission.csv')

#Look at the first few rows of the resulting DataFrame
gender_df.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

Now convert to tables

Postgresql allows the data to be imported via a Panda’s DataFrame

See Notebook 08.2 for some examples

In [8]:
training_df.to_sql('training', DB_CONNECTION, if_exists='replace', index=False)
test_df.to_sql('testset', DB_CONNECTION, if_exists='replace', index=False)
gender_df.to_sql('gender_submission', DB_CONNECTION, if_exists='replace', index=False)

Check tables have been created ok.

LIMIT can be used to restrict how many rows are returned - similar to the .head() function

In [9]:
%%sql

SELECT * FROM training
LIMIT 5;

 * postgresql://tm351:***@localhost:5432/tm351
5 rows affected.

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,None,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,None,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,None,S

Can use OFFSET to skip n records before applying the LIMIT

In [10]:
%%sql

SELECT * FROM training
LIMIT 5 OFFSET 5;

 * postgresql://tm351:***@localhost:5432/tm351
5 rows affected.

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,None,Q
1,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
2,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,None,S
3,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,None,S
4,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,None,C

LIMIT does not take negative arguments, for example, to get last 5 records, but you can sort the records in ascending/descending order to achieve the same effect:

In [11]:
%%sql

SELECT * FROM training ORDER BY Fare
LIMIT 10;

 * postgresql://tm351:***@localhost:5432/tm351
(psycopg2.errors.UndefinedColumn) column "fare" does not exist
LINE 1: SELECT * FROM training ORDER BY Fare
                                        ^
HINT:  Perhaps you meant to reference the column "training.Fare".

[SQL: SELECT * FROM training ORDER BY Fare
LIMIT 10;]
(Background on this error at: http://sqlalche.me/e/13/f405)

A quirk of the import is that if the column headings found in the first line are capitialised, Postgres assumes that you want to keep the column names capitialised when referring to them, so you will need to enclose the names in double quote:

In [12]:
%%sql

SELECT * FROM training ORDER BY "Fare"
LIMIT 10;

 * postgresql://tm351:***@localhost:5432/tm351
10 rows affected.

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,598,0,3,"Johnson, Mr. Alfred",male,49.0,0,0,LINE,0.0,None,S
1,467,0,2,"Campbell, Mr. William",male,NaN,0,0,239853,0.0,None,S
2,278,0,2,"Parkes, Mr. Francis ""Frank""",male,NaN,0,0,239853,0.0,None,S
3,482,0,2,"Frost, Mr. Anthony Wood ""Archie""",male,NaN,0,0,239854,0.0,None,S
4,264,0,1,"Harrison, Mr. William",male,40.0,0,0,112059,0.0,B94,S
5,414,0,2,"Cunningham, Mr. Alfred Fleming",male,NaN,0,0,239853,0.0,None,S
6,180,0,3,"Leonard, Mr. Lionel",male,36.0,0,0,LINE,0.0,None,S
7,272,1,3,"Tornquist, Mr. William Henry",male,25.0,0,0,LINE,0.0,None,S
8,303,0,3,"Johnson, Mr. William Cahoone Jr",male,19.0,0,0,LINE,0.0,None,S
9,634,0,1,"Parr, Mr. William Henry Marsh",male,NaN,0,0,112052,0.0,None,S

This will be tedious, so lets change the column headings and reload:

In [13]:
# Changing all the column names to lower case:
for x in training_df.columns:
    training_df.rename(columns={x : x.lower()}, inplace=True) 
    
training_df.head()

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [14]:
for x in test_df.columns:
    test_df.rename(columns={x : x.lower()}, inplace=True) 
    
test_df.head()

,passengerid,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [15]:
for x in gender_df.columns:
    gender_df.rename(columns={x : x.lower()}, inplace=True) 
    
gender_df.head()

   passengerid  survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

Now reload them all again, the *if_exists* parameter will mean the old version is overwritten:

In [16]:
training_df.to_sql('training', DB_CONNECTION, if_exists='replace', index=False)
test_df.to_sql('testset', DB_CONNECTION, if_exists='replace', index=False)
gender_df.to_sql('gender_submission', DB_CONNECTION, if_exists='replace', index=False )

Now the columns are case insensitive when referred to:

In [17]:
%%sql

SELECT * FROM training ORDER BY Fare DESC, AGE
LIMIT 10;

 * postgresql://tm351:***@localhost:5432/tm351
10 rows affected.

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,None,C
1,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C
2,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C
3,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S
4,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0000,C23 C25 C27,S
5,342,1,1,"Fortune, Miss. Alice Elizabeth",female,24.0,3,2,19950,263.0000,C23 C25 C27,S
6,439,0,1,"Fortune, Mr. Mark",male,64.0,1,4,19950,263.0000,C23 C25 C27,S
7,312,1,1,"Ryerson, Miss. Emily Borie",female,18.0,2,2,PC 17608,262.3750,B57 B59 B63 B66,C
8,743,1,1,"Ryerson, Miss. Susan Parker ""Suzette""",female,21.0,2,2,PC 17608,262.3750,B57 B59 B63 B66,C
9,119,0,1,"Baxter, Mr. Quigg Edmond",male,24.0,0,1,PC 17558,247.5208,B58 B60,C

In [18]:
%%sql
/*  
    Note if we want both columns in descending order, you need to use DESC twice, otherwise it will default to ascending
*/
SELECT * FROM training ORDER BY Fare DESC, AGE DESC
LIMIT 10;

 * postgresql://tm351:***@localhost:5432/tm351
10 rows affected.

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C
1,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,None,C
2,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C
3,439,0,1,"Fortune, Mr. Mark",male,64.0,1,4,19950,263.0000,C23 C25 C27,S
4,342,1,1,"Fortune, Miss. Alice Elizabeth",female,24.0,3,2,19950,263.0000,C23 C25 C27,S
5,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0000,C23 C25 C27,S
6,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S
7,743,1,1,"Ryerson, Miss. Susan Parker ""Suzette""",female,21.0,2,2,PC 17608,262.3750,B57 B59 B63 B66,C
8,312,1,1,"Ryerson, Miss. Emily Borie",female,18.0,2,2,PC 17608,262.3750,B57 B59 B63 B66,C
9,300,1,1,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,50.0,0,1,PC 17558,247.5208,B58 B60,C

In [19]:
%%sql
SELECT * FROM testset
LIMIT 5;

 * postgresql://tm351:***@localhost:5432/tm351
5 rows affected.

,passengerid,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,None,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,None,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,None,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,None,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,None,S

## Data Dictionary

Most relational databases contain meta-data, or data about the data. This is referred to as the data dictionary or system catalog depending on which relational database you are using.

The key thing is these are a set of system defined and maintained tables that hold information about the objects you create in a database, such as tables, views, or triggers.

Let's check what version of Postgres we are currently using:

In [20]:
! psql --version

psql (PostgreSQL) 12.8 (Ubuntu 12.8-0ubuntu0.20.04.1)

Information on PostgreSQL's system catlog tables can be found here:

https://www.postgresql.org/docs/12/catalogs.html

There is also a *information_schema* table that is a set of views that contains information about the objects defined in the current database. It can be easier to query than the system catalogs and conforms to the SQL standard. It does not contain information on PostgreSQL-specific features though. 

See here for more information:
https://www.postgresql.org/docs/12/information-schema.html

You can use the data dictionary tables to check that the tables have been created:

In [21]:
%%sql
/* check if tables created. 
        IN list can be used when searching for serveral values, otherwise would need to say:
        ... AND table_name = 'training' OR table_name = 'testset' OR table_name = 'gender_submission' */

SELECT *
FROM information_schema.tables
WHERE table_type = 'BASE TABLE' and table_schema <> 'pg_catalog'
and table_name IN ('training', 'testset', 'gender_submission');

 * postgresql://tm351:***@localhost:5432/tm351
3 rows affected.

,table_catalog,table_schema,table_name,table_type,self_referencing_column_name,reference_generation,user_defined_type_catalog,user_defined_type_schema,user_defined_type_name,is_insertable_into,is_typed,commit_action
0,tm351,public,training,BASE TABLE,None,None,None,None,None,YES,NO,None
1,tm351,public,testset,BASE TABLE,None,None,None,None,None,YES,NO,None
2,tm351,public,gender_submission,BASE TABLE,None,None,None,None,None,YES,NO,None

In [22]:
%%sql
/* what do the tables look like */

SELECT *
FROM information_schema.columns
WHERE table_name = 'training';

 * postgresql://tm351:***@localhost:5432/tm351
12 rows affected.

,table_catalog,table_schema,table_name,column_name,ordinal_position,column_default,is_nullable,data_type,character_maximum_length,character_octet_length,...,is_identity,identity_generation,identity_start,identity_increment,identity_maximum,identity_minimum,identity_cycle,is_generated,generation_expression,is_updatable
0,tm351,public,training,passengerid,1,None,YES,bigint,None,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
1,tm351,public,training,survived,2,None,YES,bigint,None,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
2,tm351,public,training,pclass,3,None,YES,bigint,None,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
3,tm351,public,training,age,6,None,YES,double precision,None,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
4,tm351,public,training,sibsp,7,None,YES,bigint,None,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
5,tm351,public,training,parch,8,None,YES,bigint,None,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
6,tm351,public,training,fare,10,None,YES,double precision,None,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
7,tm351,public,training,cabin,11,None,YES,text,None,1.073742e+09,...,NO,None,None,None,None,None,NO,NEVER,None,YES
8,tm351,public,training,name,4,None,YES,text,None,1.073742e+09,...,NO,None,None,None,None,None,NO,NEVER,None,YES
9,tm351,public,training,sex,5,None,YES,text,None,1.073742e+09,...,NO,None,None,None,None,None,NO,NEVER,None,YES
10,tm351,public,training,ticket,9,None,YES,text,None,1.073742e+09,...,NO,None,None,None,None,None,NO,NEVER,None,YES
11,tm351,public,training,embarked,12,None,YES,text,None,1.073742e+09,...,NO,None,None,None,None,None,NO,NEVER,None,YES

A pictorial representation can be easier to understand:

In [23]:
%reload_ext schemadisplay_magic

In [24]:
%schema --connection_string $DB_CONNECTION -t training

In [25]:
%schema --connection_string $DB_CONNECTION -t testset

In [26]:
%schema --connection_string $DB_CONNECTION -t gender_submission

The downside of the above method to import data is that it defaults to the TEXT data type for any string data and BIGINT/DOUBLE PRECISION for numeric, regardless of the size of the data found. TEXT is like a VARCHAR with no limit set. In a data processing type application you might want to set integrity constraints to limit the size of characters permitted. 

Looking at the manual, there are no performance gains in setting the limit and since we are working with found data, rather than setting up a data processing application, we will not try to convert them:
https://www.postgresql.org/docs/12/datatype-character.html

# Integrity constraints

A relational database provides features to enforce the integrity of the data, such ensuring each table has a column that is guaranteed to have unique values - this is the PRIMARY KEY for each table:

In [27]:
%%sql

ALTER TABLE training ADD CONSTRAINT training_pk PRIMARY KEY(passengerid);
ALTER TABLE testset ADD CONSTRAINT testset_pk PRIMARY KEY(passengerid);
ALTER TABLE gender_submission ADD CONSTRAINT gender_submission_pk PRIMARY KEY(passengerid);

 * postgresql://tm351:***@localhost:5432/tm351
Done.
Done.
Done.

Empty DataFrame
Columns: []
Index: []

Domain constraints can be used to to enforce any rules on the values, such as those seen in the data dictionary information.

For example, pclass, survival (survived) and embarked:
<pre>
survival    Survival      0 = No, 1 = Yes
pclass      Ticket class  1 = 1st, 2 = 2nd, 3 = 3rd
embarked    Port of Embarkation     C = Cherbourg, Q = Queenstown, S = Southampton
</pre>

In [28]:
%%sql

ALTER TABLE training ADD CONSTRAINT pclass_ck CHECK (pclass BETWEEN 1 AND 3);
ALTER TABLE training ADD CONSTRAINT survived_ck CHECK (survived = 0 OR survived = 1);
ALTER TABLE training ADD CONSTRAINT embarked_ck CHECK (embarked IN ('C', 'Q', 'S'));

 * postgresql://tm351:***@localhost:5432/tm351
Done.
Done.
Done.

Empty DataFrame
Columns: []
Index: []

The constraints would generate errors messages if the existing data did not match the check clause, so the data looks good.

The *Port of Embarkation* is a code for three places, which are not very meaningful. Let's add a table to contain this information:
<pre>
C = Cherbourg, Q = Queenstown, S = Southampton
</pre>

In [29]:
%%sql

CREATE TABLE embark (embarked CHAR(1) PRIMARY KEY, port VARCHAR(15));

/* add the three places */
INSERT INTO embark VALUES ('C', 'Cherbourg');
INSERT INTO embark VALUES ('Q', 'Queenstown');
INSERT INTO embark VALUES ('S', 'Southampton');

/* save the changes to the database - COMMIT needed to complete the transaction */
COMMIT;

/* add a foreign key in training to this new table */
ALTER TABLE training ADD CONSTRAINT embark_fk FOREIGN KEY(embarked) REFERENCES embark(embarked);

 * postgresql://tm351:***@localhost:5432/tm351
Done.
1 rows affected.
1 rows affected.
1 rows affected.
Done.
Done.

Empty DataFrame
Columns: []
Index: []

# Querying the data

In [30]:
%%sql
/* restrict columns */

SELECT passengerid, name, sex, age FROM training;

 * postgresql://tm351:***@localhost:5432/tm351
891 rows affected.

,passengerid,name,sex,age
0,1,"Braund, Mr. Owen Harris",male,22.0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0
2,3,"Heikkinen, Miss. Laina",female,26.0
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0
4,5,"Allen, Mr. William Henry",male,35.0
...,...,...,...,...
886,887,"Montvila, Rev. Juozas",male,27.0
887,888,"Graham, Miss. Margaret Edith",female,19.0
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN
889,890,"Behr, Mr. Karl Howell",male,26.0
890,891,"Dooley, Mr. Patrick",male,32.0

In [31]:
%%sql
/* restrict rows - female passengers */

SELECT * FROM training WHERE sex = 'female';

 * postgresql://tm351:***@localhost:5432/tm351
314 rows affected.

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
1,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,None,S
2,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
3,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,None,S
4,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,None,C
...,...,...,...,...,...,...,...,...,...,...,...,...
309,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,None,S
310,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,None,S
311,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,None,Q
312,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
313,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,None,S

In [32]:
%%sql
/* combination */

SELECT name, fare, cabin FROM training
WHERE sex = 'male';

 * postgresql://tm351:***@localhost:5432/tm351
577 rows affected.

                               name     fare cabin
0           Braund, Mr. Owen Harris   7.2500  None
1          Allen, Mr. William Henry   8.0500  None
2                  Moran, Mr. James   8.4583  None
3           McCarthy, Mr. Timothy J  51.8625   E46
4    Palsson, Master. Gosta Leonard  21.0750  None
..                              ...      ...   ...
572   Banfield, Mr. Frederick James  10.5000  None
573          Sutehall, Mr. Henry Jr   7.0500  None
574           Montvila, Rev. Juozas  13.0000  None
575           Behr, Mr. Karl Howell  30.0000  C148
576             Dooley, Mr. Patrick   7.7500  None

[577 rows x 3 columns]

Functions can be used to manipulate the data.

Details of string functions can be found here: https://www.postgresql.org/docs/12/functions-string.html

Mathematical functions and operators: https://www.postgresql.org/docs/12/functions-math.html

Or all functions and operators: https://www.postgresql.org/docs/12/functions.html

In [33]:
%%sql
/* split name into family name and given names */

SELECT SUBSTR(name, 1, POSITION(',' IN name)-1) AS surname, 
    SUBSTR(name, POSITION(',' IN name)+1, (POSITION('.' IN name)-POSITION(',' IN name)-1)) AS title,
    SUBSTR(name, POSITION('.' IN name)+1) AS firstname, name
FROM training ORDER BY surname;

 * postgresql://tm351:***@localhost:5432/tm351
891 rows affected.

,surname,title,firstname,name
0,Abbing,Mr,Anthony,"Abbing, Mr. Anthony"
1,Abbott,Mrs,Stanton (Rosa Hunt),"Abbott, Mrs. Stanton (Rosa Hunt)"
2,Abbott,Mr,Rossmore Edward,"Abbott, Mr. Rossmore Edward"
3,Abelson,Mrs,Samuel (Hannah Wizosky),"Abelson, Mrs. Samuel (Hannah Wizosky)"
4,Abelson,Mr,Samuel,"Abelson, Mr. Samuel"
...,...,...,...,...
886,de Mulder,Mr,Theodore,"de Mulder, Mr. Theodore"
887,de Pelsmaeker,Mr,Alfons,"de Pelsmaeker, Mr. Alfons"
888,del Carlo,Mr,Sebastiano,"del Carlo, Mr. Sebastiano"
889,van Billiard,Mr,Austin Blyler,"van Billiard, Mr. Austin Blyler"
890,van Melkebeke,Mr,Philemon,"van Melkebeke, Mr. Philemon"

# Pattern Matching

LIKE can be used to search for patterns in the data. 
Use percent (%) to search for any character length, underscore (_) for a single character.

PostgreSQL also supports regular expressions, see the manual for other ways to pattern match:
https://www.postgresql.org/docs/12/functions-matching.html

In [34]:
%%sql
/* any Smiths in the passengers. Use UPPER() or LOWER() to match case correctly */
SELECT name
FROM training
WHERE LOWER(name) LIKE '%smith%';

 * postgresql://tm351:***@localhost:5432/tm351
7 rows affected.

                                              name
0  Goldsmith, Master. Frank John William "Frankie"
1                          Smith, Mr. James Clinch
2                                Smith, Mr. Thomas
3                       Smith, Mr. Richard William
4   Goldsmith, Mrs. Frank John (Emily Alice Brown)
5                        Smith, Miss. Marion Elsie
6                        Goldsmith, Mr. Frank John

In [35]:
%%sql
/* Without LOWER() to show that the Smiths are now lost */
SELECT name
FROM training
WHERE name LIKE '%smith%';

 * postgresql://tm351:***@localhost:5432/tm351
3 rows affected.

                                              name
0  Goldsmith, Master. Frank John William "Frankie"
1   Goldsmith, Mrs. Frank John (Emily Alice Brown)
2                        Goldsmith, Mr. Frank John

In [36]:
%%sql
/* But you might only want those beginning with Smith */
SELECT name
FROM training
WHERE name LIKE '%Smith%';

 * postgresql://tm351:***@localhost:5432/tm351
4 rows affected.

                         name
0     Smith, Mr. James Clinch
1           Smith, Mr. Thomas
2  Smith, Mr. Richard William
3   Smith, Miss. Marion Elsie

In [37]:
%%sql
/* Search for any tickets where forward slash is the second character */
SELECT name, cabin, ticket
FROM training
WHERE ticket LIKE '_/%';

 * postgresql://tm351:***@localhost:5432/tm351
27 rows affected.

                                               name cabin      ticket
0                           Braund, Mr. Owen Harris  None   A/5 21171
1                    Saundercock, Mr. William Henry  None   A/5. 2151
2                      Nosworthy, Mr. Richard Cater  None  A/4. 39886
3    Robins, Mrs. Alexander A (Grace Charity Laury)  None   A/5. 3337
4                   van Billiard, Mr. Austin Blyler  None    A/5. 851
5                          Cohen, Mr. Gurshon "Gus"  None    A/5 3540
6                            Perkin, Mr. John Henry  None   A/5 21174
7                                Harris, Mr. Walter  None   W/C 14208
8                   Lovell, Mr. John Hall ("Henry")  None   A/5 21173
9                          Lobb, Mr. William Arthur  None   A/5. 3336
10                       Dorking, Mr. Edward Arthur  None  A/5. 10482
11                Williams, Mr. Howard Hugh "Harry"  None    A/5 2466
12                              Abelson, Mr. Samuel  None   P/PP 3381
13                               Dennis, Mr. Samuel  None   A/5 21172
14                              Charters, Mr. David  None  A/5. 13032
15                           Wiseman, Mr. Phillippe  None  A/4. 34244
16                              Peduzzi, Mr. Joseph  None    A/5 2817
17                               Maisner, Mr. Simon  None    A/S 2816
18                         Rouse, Mr. Richard Henry  None    A/5 3594
19                       Stanley, Mr. Edward Roland  None   A/4 45380
20                             Davies, Mr. Alfred J  None   A/4 48871
21                     Rush, Mr. Alfred George John  None  A/4. 20589
22                       Elsbury, Mr. William James  None    A/5 3902
23  Lobb, Mrs. William Arthur (Cordelia K Stanlick)  None   A/5. 3336
24                                  Cook, Mr. Jacob  None    A/5 3536
25                                Lester, Mr. James  None   A/4 48871
26            Abelson, Mrs. Samuel (Hannah Wizosky)  None   P/PP 3381

Joins
===

Good database design aims to avoid duplication in the data, normalisation can help with this. One consequence is that the data will then be split into several tables. When querying the data, the results will often need to come from more than one table. This is where JOINs come in.

In SQL this is achieved by comparing values held under a column in one table with values held under a column in a different table. A join will only include rows where there is a matching value in both tables.

In [38]:
%%sql
/* traditional way to join tables, using table aliases */

SELECT name, fare, port
FROM training t, embark e
WHERE t.embarked = e.embarked;

 * postgresql://tm351:***@localhost:5432/tm351
889 rows affected.

                                           name      fare         port
0                          Nasser, Mr. Nicholas   30.0708    Cherbourg
1                     Harper, Mr. Henry Sleeper   76.7292    Cherbourg
2                           Novel, Mr. Mansouer    7.2292    Cherbourg
3           Simonius-Blumer, Col. Oberst Alfons   35.5000    Cherbourg
4                               Elias, Mr. Dibo    7.2250    Cherbourg
..                                          ...       ...          ...
884                Blackwell, Mr. Stephen Weart   35.5000  Southampton
885              Navratil, Master. Edmond Roger   26.0000  Southampton
886              Fortune, Miss. Alice Elizabeth  263.0000  Southampton
887                  Collander, Mr. Erik Gustaf   13.0000  Southampton
888  Sedgwick, Mr. Charles Frederick Waddington   13.0000  Southampton

[889 rows x 3 columns]

Hint: do check the number of rows returned from any join, you should never get more rows than there are in any of the tables used. If you do, check that the tables are joined correctly.

In [39]:
%%sql
/* traditional way to join, restricting to over 17s only */

SELECT name, fare, age, port
FROM training t, embark e
WHERE t.embarked = e.embarked
AND age >= 18;

 * postgresql://tm351:***@localhost:5432/tm351
599 rows affected.

,name,fare,age,port
0,"Duff Gordon, Lady. (Lucille Christiana Sutherl...",39.6000,48.0,Cherbourg
1,"Barbara, Miss. Saiide",14.4542,18.0,Cherbourg
2,"Baclini, Mrs. Solomon (Latifa Qurban)",19.2583,24.0,Cherbourg
3,"Uruchurtu, Don. Manuel E",27.7208,40.0,Cherbourg
4,"LeRoy, Miss. Bertha",106.4250,30.0,Cherbourg
...,...,...,...,...
594,"Hold, Mr. Stephen",26.0000,44.0,Southampton
595,"Pengelly, Mr. Frederick William",10.5000,19.0,Southampton
596,"Hunt, Mr. George Henry",12.2750,33.0,Southampton
597,"Coleridge, Mr. Reginald Charles",10.5000,29.0,Southampton
598,"Maenpaa, Mr. Matti Alexanteri",7.1250,22.0,Southampton

In [40]:
%%sql
/* ANSI join */

SELECT name, fare, age, port
FROM training t JOIN embark e ON t.embarked = e.embarked
AND age >= 18;

 * postgresql://tm351:***@localhost:5432/tm351
599 rows affected.

,name,fare,age,port
0,"Duff Gordon, Lady. (Lucille Christiana Sutherl...",39.6000,48.0,Cherbourg
1,"Barbara, Miss. Saiide",14.4542,18.0,Cherbourg
2,"Baclini, Mrs. Solomon (Latifa Qurban)",19.2583,24.0,Cherbourg
3,"Uruchurtu, Don. Manuel E",27.7208,40.0,Cherbourg
4,"LeRoy, Miss. Bertha",106.4250,30.0,Cherbourg
...,...,...,...,...
594,"Hold, Mr. Stephen",26.0000,44.0,Southampton
595,"Pengelly, Mr. Frederick William",10.5000,19.0,Southampton
596,"Hunt, Mr. George Henry",12.2750,33.0,Southampton
597,"Coleridge, Mr. Reginald Charles",10.5000,29.0,Southampton
598,"Maenpaa, Mr. Matti Alexanteri",7.1250,22.0,Southampton

In [41]:
%%sql
/* ANSI join */

SELECT name, fare, age, port
FROM training t JOIN embark e ON t.embarked = e.embarked;

 * postgresql://tm351:***@localhost:5432/tm351
889 rows affected.

                                           name      fare   age         port
0                          Nasser, Mr. Nicholas   30.0708  32.5    Cherbourg
1                     Harper, Mr. Henry Sleeper   76.7292  48.0    Cherbourg
2                           Novel, Mr. Mansouer    7.2292  28.5    Cherbourg
3           Simonius-Blumer, Col. Oberst Alfons   35.5000  56.0    Cherbourg
4                               Elias, Mr. Dibo    7.2250   NaN    Cherbourg
..                                          ...       ...   ...          ...
884                Blackwell, Mr. Stephen Weart   35.5000  45.0  Southampton
885              Navratil, Master. Edmond Roger   26.0000   2.0  Southampton
886              Fortune, Miss. Alice Elizabeth  263.0000  24.0  Southampton
887                  Collander, Mr. Erik Gustaf   13.0000  28.0  Southampton
888  Sedgwick, Mr. Charles Frederick Waddington   13.0000  25.0  Southampton

[889 rows x 4 columns]

The above joins are examples of an equi-join, where the rows are joined provided there is a matching value in both tables for the column(s) used for the join. There are also OUTER JOINs which are useful if you have an optional relationship between the two tables, where data for one object is not in both tables, for instance, if had information about a passenger in the testset table, but was missing in the gender_submission table. 

OUTER JOINs can be LEFT, RIGHT or FULL. LEFT and RIGHT mean the table on either the left or right of the JOIN condition is the driving table, in that all rows will be listed for that table, despite whether it has a matching value. A FULL OUTER JOIN will include rows from both tables, regardless of whether a matching value is found in both tables. Given, joins are usually based on the primary key and foreign key fields, integrity constraints usually mean the OUTER JOIN is where there is a null value in the foreign key field, rather than having a value that has no matching counterpart.

Note the above join of training and embark returns 889 rows. 

An addition is going to be made to the Embark table, a new port of Liverpool will be added.

In [42]:
%%sql
INSERT INTO embark VALUES ('L', 'Liverpool');
COMMIT;

 * postgresql://tm351:***@localhost:5432/tm351
1 rows affected.
Done.

Empty DataFrame
Columns: []
Index: []

Run the equi-JOIN query again and still 889 records are returned.

In [43]:
%%sql
/* ANSI join */

SELECT name, fare, age, port
FROM training t JOIN embark e ON t.embarked = e.embarked;

 * postgresql://tm351:***@localhost:5432/tm351
889 rows affected.

                                           name      fare   age         port
0                          Nasser, Mr. Nicholas   30.0708  32.5    Cherbourg
1                     Harper, Mr. Henry Sleeper   76.7292  48.0    Cherbourg
2                           Novel, Mr. Mansouer    7.2292  28.5    Cherbourg
3           Simonius-Blumer, Col. Oberst Alfons   35.5000  56.0    Cherbourg
4                               Elias, Mr. Dibo    7.2250   NaN    Cherbourg
..                                          ...       ...   ...          ...
884                Blackwell, Mr. Stephen Weart   35.5000  45.0  Southampton
885              Navratil, Master. Edmond Roger   26.0000   2.0  Southampton
886              Fortune, Miss. Alice Elizabeth  263.0000  24.0  Southampton
887                  Collander, Mr. Erik Gustaf   13.0000  28.0  Southampton
888  Sedgwick, Mr. Charles Frederick Waddington   13.0000  25.0  Southampton

[889 rows x 4 columns]

This is because no passengers embarked at Liverpool, it was where the Titanic was registered.

Change this to an RIGHT OUTER JOIN and the query now returns 890 rows, which will include Liverpool in the results.

In [44]:
%%sql
/* RIGHT OUTER join */

SELECT name, fare, age, port
FROM training t RIGHT OUTER JOIN embark e ON t.embarked = e.embarked;

 * postgresql://tm351:***@localhost:5432/tm351
890 rows affected.

                                           name      fare   age         port
0                          Nasser, Mr. Nicholas   30.0708  32.5    Cherbourg
1                     Harper, Mr. Henry Sleeper   76.7292  48.0    Cherbourg
2                           Novel, Mr. Mansouer    7.2292  28.5    Cherbourg
3           Simonius-Blumer, Col. Oberst Alfons   35.5000  56.0    Cherbourg
4                               Elias, Mr. Dibo    7.2250   NaN    Cherbourg
..                                          ...       ...   ...          ...
885                Blackwell, Mr. Stephen Weart   35.5000  45.0  Southampton
886              Navratil, Master. Edmond Roger   26.0000   2.0  Southampton
887              Fortune, Miss. Alice Elizabeth  263.0000  24.0  Southampton
888                  Collander, Mr. Erik Gustaf   13.0000  28.0  Southampton
889  Sedgwick, Mr. Charles Frederick Waddington   13.0000  25.0  Southampton

[890 rows x 4 columns]

Liverpool is lost in all the results, we can also add a constraint to the rows returned, in this case list the passengers over 70. Liverpool now appears, with null values for any missing information, in this case the passenger details.

In [45]:
%%sql
/* RIGHT OUTER join */

SELECT name, fare, age, port
FROM training t RIGHT OUTER JOIN embark e ON t.embarked = e.embarked AND age > 70;

 * postgresql://tm351:***@localhost:5432/tm351
6 rows affected.

                                   name     fare   age         port
0             Goldschmidt, Mr. George B  34.6542  71.0    Cherbourg
1               Artagaveytia, Mr. Ramon  49.5042  71.0    Cherbourg
2                                  None      NaN   NaN    Liverpool
3                  Connors, Mr. Patrick   7.7500  70.5   Queenstown
4  Barkworth, Mr. Algernon Henry Wilson  30.0000  80.0  Southampton
5                   Svensson, Mr. Johan   7.7750  74.0  Southampton

Be careful where the restriction is added. If a WHERE clause is used, it negates the effect of the OUTER join! If you want to keep the effect of the OUTER join, then add the restriction to the OUTER JOIN clause.

In [46]:
%%sql
/* RIGHT OUTER join? */

SELECT name, fare, age, port
FROM training t RIGHT OUTER JOIN embark e ON t.embarked = e.embarked
WHERE age > 70;

 * postgresql://tm351:***@localhost:5432/tm351
5 rows affected.

                                   name     fare   age         port
0             Goldschmidt, Mr. George B  34.6542  71.0    Cherbourg
1               Artagaveytia, Mr. Ramon  49.5042  71.0    Cherbourg
2                  Connors, Mr. Patrick   7.7500  70.5   Queenstown
3  Barkworth, Mr. Algernon Henry Wilson  30.0000  80.0  Southampton
4                   Svensson, Mr. Johan   7.7750  74.0  Southampton

A LEFT OUTER join will return all passengers even if their port of embarkation is unknown. LEFT means the training table is now the driving table.

In [47]:
%%sql
/* LEFT OUTER join */

SELECT name, fare, age, port
FROM training t LEFT OUTER JOIN embark e ON t.embarked = e.embarked;

 * postgresql://tm351:***@localhost:5432/tm351
891 rows affected.

                                           name      fare   age         port
0                          Nasser, Mr. Nicholas   30.0708  32.5    Cherbourg
1                     Harper, Mr. Henry Sleeper   76.7292  48.0    Cherbourg
2                           Novel, Mr. Mansouer    7.2292  28.5    Cherbourg
3           Simonius-Blumer, Col. Oberst Alfons   35.5000  56.0    Cherbourg
4                               Elias, Mr. Dibo    7.2250   NaN    Cherbourg
..                                          ...       ...   ...          ...
886              Fortune, Miss. Alice Elizabeth  263.0000  24.0  Southampton
887                  Collander, Mr. Erik Gustaf   13.0000  28.0  Southampton
888  Sedgwick, Mr. Charles Frederick Waddington   13.0000  25.0  Southampton
889   Stone, Mrs. George Nelson (Martha Evelyn)   80.0000  62.0         None
890                         Icard, Miss. Amelie   80.0000  38.0         None

[891 rows x 4 columns]

The last two rows show the two passengers who are missing the information for the port embarked.

Or just look for the passengers with no related port:

In [48]:
%%sql
/* LEFT OUTER join */

SELECT name, fare, age, port
FROM training t LEFT OUTER JOIN embark e ON t.embarked = e.embarked 
WHERE port IS NULL;

 * postgresql://tm351:***@localhost:5432/tm351
2 rows affected.

                                        name  fare   age  port
0  Stone, Mrs. George Nelson (Martha Evelyn)  80.0  62.0  None
1                        Icard, Miss. Amelie  80.0  38.0  None

In [49]:
%%sql
/* FULL OUTER join */

SELECT name, fare, age, port
FROM training t FULL OUTER JOIN embark e ON t.embarked = e.embarked ;

 * postgresql://tm351:***@localhost:5432/tm351
892 rows affected.

                                           name      fare   age         port
0                          Nasser, Mr. Nicholas   30.0708  32.5    Cherbourg
1                     Harper, Mr. Henry Sleeper   76.7292  48.0    Cherbourg
2                           Novel, Mr. Mansouer    7.2292  28.5    Cherbourg
3           Simonius-Blumer, Col. Oberst Alfons   35.5000  56.0    Cherbourg
4                               Elias, Mr. Dibo    7.2250   NaN    Cherbourg
..                                          ...       ...   ...          ...
887              Fortune, Miss. Alice Elizabeth  263.0000  24.0  Southampton
888                  Collander, Mr. Erik Gustaf   13.0000  28.0  Southampton
889  Sedgwick, Mr. Charles Frederick Waddington   13.0000  25.0  Southampton
890   Stone, Mrs. George Nelson (Martha Evelyn)   80.0000  62.0         None
891                         Icard, Miss. Amelie   80.0000  38.0         None

[892 rows x 4 columns]

The above shows records from both tables whether there is a match or not, note there are 892 rows returned.

# Statistics

Some queries will involve statistical analysis rather than listing rows from the tables.

This will involve aggregate functions, further examples can be found here: 
https://www.postgresql.org/docs/12/functions-aggregate.html

In [50]:
%%sql
SELECT COUNT(*) AS training_count FROM training;

 * postgresql://tm351:***@localhost:5432/tm351
1 rows affected.

   training_count
0             891

In [51]:
%%sql
SELECT COUNT(*) AS test_count FROM testset;

 * postgresql://tm351:***@localhost:5432/tm351
1 rows affected.

   test_count
0         418

In [52]:
%%sql
SELECT sex, survived, COUNT(*) AS gender_count FROM training
GROUP BY sex, survived
ORDER BY survived;

 * postgresql://tm351:***@localhost:5432/tm351
4 rows affected.

      sex  survived  gender_count
0    male         0           468
1  female         0            81
2    male         1           109
3  female         1           233

In [53]:
%%sql
SELECT pclass, survived, COUNT(*) AS class_count FROM training
GROUP BY pclass, survived
ORDER BY pclass;

 * postgresql://tm351:***@localhost:5432/tm351
6 rows affected.

   pclass  survived  class_count
0       1         1          136
1       1         0           80
2       2         0           97
3       2         1           87
4       3         0          372
5       3         1          119

In [54]:
%%sql
/*  count by class and gender
    you can group by several columns, but note that the GROUP BY must match the columns in the SELECT clause.
    CASE can be used to make the results more meaningful */

SELECT pclass, CASE survived WHEN 0 THEN 'No' ELSE 'Yes' END AS survived, sex, COUNT(*) AS class_count FROM training
GROUP BY pclass, survived, sex
ORDER BY pclass;

 * postgresql://tm351:***@localhost:5432/tm351
12 rows affected.

    pclass survived     sex  class_count
0        1       No    male           77
1        1      Yes  female           91
2        1      Yes    male           45
3        1       No  female            3
4        2      Yes  female           70
5        2       No  female            6
6        2      Yes    male           17
7        2       No    male           91
8        3      Yes  female           72
9        3      Yes    male           47
10       3       No    male          300
11       3       No  female           72

You may want to restrict the results generated. Would the following query be correct:

In [55]:
%%sql
SELECT pclass, survived, COUNT(*) AS class_count FROM training
GROUP BY pclass, survived
WHERE COUNT(*) > 100
ORDER BY pclass;

 * postgresql://tm351:***@localhost:5432/tm351
(psycopg2.errors.SyntaxError) syntax error at or near "WHERE"
LINE 3: WHERE COUNT(*) > 100
        ^

[SQL: SELECT pclass, survived, COUNT(*) AS class_count FROM training
GROUP BY pclass, survived
WHERE COUNT(*) > 100
ORDER BY pclass;]
(Background on this error at: http://sqlalche.me/e/13/f405)

No, the above query should not work, because the WHERE clause is referencing a GROUP function. If you want to restrict the rows used in the group function, use HAVING instead:

In [56]:
%%sql
/* Having is like a WHERE clause on the group function: */

SELECT pclass, survived, COUNT(*) AS class_count FROM training
GROUP BY pclass, survived
HAVING COUNT(*) > 100
ORDER BY pclass;

 * postgresql://tm351:***@localhost:5432/tm351
3 rows affected.

   pclass  survived  class_count
0       1         1          136
1       3         0          372
2       3         1          119

In [57]:
%%sql
/* Can have a WHERE and HAVING clause together */

SELECT pclass, survived, COUNT(*) AS class_count FROM training
WHERE sex = 'male'
GROUP BY pclass, survived
HAVING COUNT(*) > 50
ORDER BY pclass;

 * postgresql://tm351:***@localhost:5432/tm351
3 rows affected.

   pclass  survived  class_count
0       1         0           77
1       2         0           91
2       3         0          300

# Subqueries:

Rather than hard-coding a value to search for in the WHERE clause, you may want to search on a value generated from the database. This is where subqueries can be used.

In [58]:
%%sql
/* Who is the eldest passenger? */

SELECT passengerid, name, age, sex FROM training WHERE age = 
    (SELECT MAX(age) FROM training);

 * postgresql://tm351:***@localhost:5432/tm351
1 rows affected.

   passengerid                                  name   age   sex
0          631  Barkworth, Mr. Algernon Henry Wilson  80.0  male

In [89]:
%%sql
/* Who paid the most expensive ticket */

SELECT passengerid, name, age, sex, fare, pclass, cabin FROM training WHERE fare = 
    (SELECT MAX(fare) FROM training);

 * postgresql://tm351:***@localhost:5432/tm351
3 rows affected.

,passengerid,name,age,sex,fare,pclass,cabin
0,259,"Ward, Miss. Anna",35.0,female,512.3292,1,None
1,680,"Cardeza, Mr. Thomas Drake Martinez",36.0,male,512.3292,1,B51 B53 B55
2,738,"Lesurer, Mr. Gustave J",35.0,male,512.3292,1,B101

In [85]:
%%sql
/* or cheapest ticket */

SELECT passengerid, name, age, sex, fare, pclass, cabin FROM training WHERE fare = 
    (SELECT MIN(fare) FROM training);

 * postgresql://tm351:***@localhost:5432/tm351
15 rows affected.

,passengerid,name,age,sex,fare,pclass,cabin
0,180,"Leonard, Mr. Lionel",36.0,male,0.0,3,None
1,264,"Harrison, Mr. William",40.0,male,0.0,1,B94
2,272,"Tornquist, Mr. William Henry",25.0,male,0.0,3,None
3,278,"Parkes, Mr. Francis ""Frank""",NaN,male,0.0,2,None
4,303,"Johnson, Mr. William Cahoone Jr",19.0,male,0.0,3,None
5,414,"Cunningham, Mr. Alfred Fleming",NaN,male,0.0,2,None
6,467,"Campbell, Mr. William",NaN,male,0.0,2,None
7,482,"Frost, Mr. Anthony Wood ""Archie""",NaN,male,0.0,2,None
8,598,"Johnson, Mr. Alfred",49.0,male,0.0,3,None
9,634,"Parr, Mr. William Henry Marsh",NaN,male,0.0,1,None
10,675,"Watson, Mr. Ennis Hastings",NaN,male,0.0,2,None
11,733,"Knight, Mr. Robert J",NaN,male,0.0,2,None
12,807,"Andrews, Mr. Thomas Jr",39.0,male,0.0,1,A36
13,816,"Fry, Mr. Richard",NaN,male,0.0,1,B102
14,823,"Reuchlin, Jonkheer. John George",38.0,male,0.0,1,None

Hmmm, perhaps some fares were for more than one person. Let's return fares more than 0

In [87]:
%%sql
/* or cheapest ticket */

SELECT passengerid, name, age, sex, fare, pclass, cabin FROM training WHERE fare = 
    (SELECT MIN(fare) FROM training WHERE fare > 0);

 * postgresql://tm351:***@localhost:5432/tm351
1 rows affected.

   passengerid                 name   age   sex    fare  pclass cabin
0          379  Betros, Mr. Tannous  20.0  male  4.0125       3  None

Subqueries can be used wherever a column or table name is expected.

In [59]:
%%sql
/* Column subquery */
    
SELECT passengerid, name, cabin, fare,
    (SELECT MAX(fare) as max_fare FROM training), 
    (SELECT MAX(fare) FROM training)-fare as Difference 
FROM training;

 * postgresql://tm351:***@localhost:5432/tm351
891 rows affected.

,passengerid,name,cabin,fare,max_fare,difference
0,1,"Braund, Mr. Owen Harris",None,7.2500,512.3292,505.0792
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",C85,71.2833,512.3292,441.0459
2,3,"Heikkinen, Miss. Laina",None,7.9250,512.3292,504.4042
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",C123,53.1000,512.3292,459.2292
4,5,"Allen, Mr. William Henry",None,8.0500,512.3292,504.2792
...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",None,13.0000,512.3292,499.3292
887,888,"Graham, Miss. Margaret Edith",B42,30.0000,512.3292,482.3292
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",None,23.4500,512.3292,488.8792
889,890,"Behr, Mr. Karl Howell",C148,30.0000,512.3292,482.3292
890,891,"Dooley, Mr. Patrick",None,7.7500,512.3292,504.5792

In the above examples, the inner subquery runs independently of the outer query. For some queries, you may want to link the two queries together and use values from the outer query in the subquery, which is called a correlated subquery.

For example, the following includes two subqueries: 
- *total_count* counts the total number of passengers;
- *difference* subtracts the total survived by gender *(gender_count)* from the overall count, in this case we want to link the values in the sex and survived fields from the outer query (t2) and the inner query (t1)

In [60]:
%%sql
SELECT sex, CASE survived WHEN 0 THEN 'No' ELSE 'Yes' END AS survived, COUNT(*) AS gender_count, 
    (SELECT COUNT(*) FROM training) AS total_count,
    ((SELECT COUNT(*) FROM training) - (SELECT COUNT(*) FROM training t1 
      WHERE t1.sex = t2.sex AND t1.survived = t2.survived 
      GROUP BY sex, survived ORDER BY survived)) AS difference
FROM training t2
GROUP BY sex, survived
ORDER BY survived;

 * postgresql://tm351:***@localhost:5432/tm351
4 rows affected.

      sex survived  gender_count  total_count  difference
0    male       No           468          891         423
1  female       No            81          891         810
2    male      Yes           109          891         782
3  female      Yes           233          891         658

In [61]:
%%sql
/*  Calculate percentage of how many passengers survived or not by sex.
    Getting the brackets correct for percentage is vital! 
    CASTing counts to to float/2 needed otherwise get incorrect results.
    ROUND needs numeric type
    
    A correlated subquery query is needed to link up the correct figures for sex and survived */

SELECT sex, CASE survived WHEN 0 THEN 'No' ELSE 'Yes' END AS survived, 
    COUNT(*) AS gender_count, 
    (SELECT COUNT(*) FROM training) AS total_count,
    ((SELECT COUNT(*) FROM training) - (SELECT COUNT(*) FROM training t1 
      WHERE t1.sex = t2.sex AND t1.survived = t2.survived 
      GROUP BY sex, survived)) AS difference,
    ROUND(((
        ((SELECT COUNT(*) FROM training t1 
          WHERE t1.sex = t2.sex AND t1.survived = t2.survived 
          GROUP BY sex, survived)::float/2)
        / 
        ((SELECT COUNT(*) FROM training)::float/2)) * 100)::numeric, 2) AS percentage
    FROM training t2
GROUP BY sex, survived
ORDER BY percentage DESC;

 * postgresql://tm351:***@localhost:5432/tm351
4 rows affected.

      sex survived  gender_count  total_count  difference  percentage
0    male       No           468          891         423       52.53
1  female      Yes           233          891         658       26.15
2    male      Yes           109          891         782       12.23
3  female       No            81          891         810        9.09

Do some queries using testset and the gender_submission tables

In [79]:
%%sql
select * from testset LIMIT 2;

 * postgresql://tm351:***@localhost:5432/tm351
2 rows affected.

,passengerid,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,None,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,None,S

In [80]:
%%sql
select * from gender_submission LIMIT 2;

 * postgresql://tm351:***@localhost:5432/tm351
2 rows affected.

   passengerid  survived
0          892         0
1          893         1

In [64]:
%%sql
/*  Look at the testset data but it is missing the survived data.
    Use pclass to see if it is likely to affect the survival rate */

SELECT sex,  
    COUNT(*) AS gender_count, pclass,
    (SELECT COUNT(*) FROM testset) AS total_count,
    ((SELECT COUNT(*) FROM testset) - (SELECT COUNT(*) FROM testset t1 
      WHERE t1.sex = t2.sex  AND t1.pclass = t2.pclass
      GROUP BY sex)) AS difference,
    ROUND(((
        ((SELECT COUNT(*) FROM testset t1 
          WHERE t1.sex = t2.sex AND t1.pclass = t2.pclass 
          GROUP BY sex, pclass)::float/2)
        / 
        ((SELECT COUNT(*) FROM testset)::float/2)) * 100)::numeric, 2) AS percentage
    FROM testset t2
GROUP BY sex, pclass
ORDER BY percentage DESC;

 * postgresql://tm351:***@localhost:5432/tm351
6 rows affected.

      sex  gender_count  pclass  total_count  difference  percentage
0    male           146       3          418         272       34.93
1  female            72       3          418         346       17.22
2    male            63       2          418         355       15.07
3    male            57       1          418         361       13.64
4  female            50       1          418         368       11.96
5  female            30       2          418         388        7.18

In [65]:
%%sql
/*  Look at the testset data but it is missing the survived data.
    Use pclass to see if it is likely to affect the survival rate */

SELECT sex,  
    COUNT(*) AS gender_count, pclass,
    (SELECT COUNT(*) FROM testset) AS total_count,
    ROUND(((
        ((SELECT COUNT(*) FROM testset t1 
          WHERE t1.sex = t2.sex AND t1.pclass = t2.pclass 
          GROUP BY sex, pclass)::float/2)
        / 
        ((SELECT COUNT(*) FROM testset)::float/2)) * 100)::numeric, 2) AS percentage
    FROM testset t2
GROUP BY sex, pclass
ORDER BY percentage DESC;

 * postgresql://tm351:***@localhost:5432/tm351
6 rows affected.

      sex  gender_count  pclass  total_count  percentage
0    male           146       3          418       34.93
1  female            72       3          418       17.22
2    male            63       2          418       15.07
3    male            57       1          418       13.64
4  female            50       1          418       11.96
5  female            30       2          418        7.18

In [66]:
%%sql

SELECT CASE survived WHEN 0 THEN 'No' ELSE 'Yes' END AS survived, sex, pclass,
    COUNT(*) AS gender_count, 
    (SELECT COUNT(*) FROM testset) AS total_count,
    ROUND(((
        ((SELECT COUNT(*) FROM testset t1, gender_submission gs
          WHERE t1.sex = t2.sex AND t1.pclass = t2.pclass 
          AND t1.passengerid = gs.passengerid
          GROUP BY survived, sex, pclass)::float/2)
        / 
        ((SELECT COUNT(*) FROM testset)::float/2)) * 100)::numeric, 2) AS percentage
FROM testset t2, gender_submission gs
WHERE t2.passengerid = gs.passengerid
GROUP BY survived, sex, pclass 
ORDER BY percentage DESC;

 * postgresql://tm351:***@localhost:5432/tm351
6 rows affected.

  survived     sex  pclass  gender_count  total_count  percentage
0       No    male       3           146          418       34.93
1      Yes  female       3            72          418       17.22
2       No    male       2            63          418       15.07
3       No    male       1            57          418       13.64
4      Yes  female       1            50          418       11.96
5      Yes  female       2            30          418        7.18

The results seen in gender_submission do seem to be based on the gender and pclass.

In [67]:
%%sql

SELECT CASE survived WHEN 0 THEN 'No' ELSE 'Yes' END AS survived, sex, pclass,
    COUNT(*) AS count
FROM testset t2, gender_submission gs
WHERE t2.passengerid = gs.passengerid
GROUP BY survived, sex, pclass 
ORDER BY pclass DESC;

 * postgresql://tm351:***@localhost:5432/tm351
6 rows affected.

  survived     sex  pclass  count
0       No    male       3    146
1      Yes  female       3     72
2       No    male       2     63
3      Yes  female       2     30
4       No    male       1     57
5      Yes  female       1     50

Drill down to 3rd class females - get same figure:

In [68]:
%%sql
SELECT CASE survived WHEN 0 THEN 'No' ELSE 'Yes' END AS survived, sex, pclass
FROM testset t2, gender_submission gs
WHERE t2.passengerid = gs.passengerid
and pclass = 3 and sex = 'female' AND survived = 1;

 * postgresql://tm351:***@localhost:5432/tm351
72 rows affected.

   survived     sex  pclass
0       Yes  female       3
1       Yes  female       3
2       Yes  female       3
3       Yes  female       3
4       Yes  female       3
..      ...     ...     ...
67      Yes  female       3
68      Yes  female       3
69      Yes  female       3
70      Yes  female       3
71      Yes  female       3

[72 rows x 3 columns]

In [69]:
%%sql
/*
    Alternative way of searching for male passengers.
    Note, you need to use IN rather than equals (=) for comparison, 
    since more than one user_id will be returned.
*/

SELECT passengerid, age, sex
FROM training 
WHERE passengerid IN 
    (SELECT passengerid FROM training WHERE sex = 'male');

 * postgresql://tm351:***@localhost:5432/tm351
577 rows affected.

     passengerid   age   sex
0              1  22.0  male
1              5  35.0  male
2              6   NaN  male
3              7  54.0  male
4              8   2.0  male
..           ...   ...   ...
572          884  28.0  male
573          885  25.0  male
574          887  27.0  male
575          890  26.0  male
576          891  32.0  male

[577 rows x 3 columns]

In [70]:
%%sql
/* Do any of the passengers exist in the test dataset */

SELECT passengerid 
FROM training
WHERE passengerid IN (SELECT passengerid FROM testset);

 * postgresql://tm351:***@localhost:5432/tm351
0 rows affected.

Empty DataFrame
Columns: []
Index: []

In [71]:
%%sql
/* or vice-versa */

SELECT passengerid 
FROM testset
WHERE passengerid IN (SELECT passengerid FROM training);

 * postgresql://tm351:***@localhost:5432/tm351
0 rows affected.

Empty DataFrame
Columns: []
Index: []

Misc Exercises
=====

Why do these generate errors:

In [72]:
%%sql
SELECT passengerid, name, cabin, survived
FROM testset, gender_submission
WHERE passengerid = passengerid;

 * postgresql://tm351:***@localhost:5432/tm351
(psycopg2.errors.AmbiguousColumn) column reference "passengerid" is ambiguous
LINE 1: SELECT passengerid, name, cabin, survived
               ^

[SQL: SELECT passengerid, name, cabin, survived
FROM testset, gender_submission
WHERE passengerid = passengerid;]
(Background on this error at: http://sqlalche.me/e/13/f405)

In [73]:
%%sql
SELECT passengerid, name, cabin, survived
FROM testset t, gender_submission gs
WHERE t.passengerid = gs.passengerid;

 * postgresql://tm351:***@localhost:5432/tm351
(psycopg2.errors.AmbiguousColumn) column reference "passengerid" is ambiguous
LINE 1: SELECT passengerid, name, cabin, survived
               ^

[SQL: SELECT passengerid, name, cabin, survived
FROM testset t, gender_submission gs
WHERE t.passengerid = gs.passengerid;]
(Background on this error at: http://sqlalche.me/e/13/f405)

Both of the above do not work because the passengerid appears in both of the tables appearing in the FROM clause, so you need to tell the database which one you want.

In [74]:
%%sql
SELECT t.passengerid, name, cabin, survived
FROM testset t, gender_submission gs
WHERE t.passengerid = gs.passengerid;

 * postgresql://tm351:***@localhost:5432/tm351
418 rows affected.

     passengerid                                          name cabin  survived
0            892                              Kelly, Mr. James  None         0
1            893              Wilkes, Mrs. James (Ellen Needs)  None         1
2            894                     Myles, Mr. Thomas Francis  None         0
3            895                              Wirz, Mr. Albert  None         0
4            896  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  None         1
..           ...                                           ...   ...       ...
413         1305                            Spector, Mr. Woolf  None         0
414         1306                  Oliva y Ocana, Dona. Fermina  C105         1
415         1307                  Saether, Mr. Simon Sivertsen  None         0
416         1308                           Ware, Mr. Frederick  None         0
417         1309                      Peter, Master. Michael J  None         0

[418 rows x 4 columns]

In [75]:
%%sql
SELECT embarked, AVG(fare) FROM training GROUP BY fare;

 * postgresql://tm351:***@localhost:5432/tm351
(psycopg2.errors.GroupingError) column "training.embarked" must appear in the GROUP BY clause or be used in an aggregate function
LINE 1: SELECT embarked, AVG(fare) FROM training GROUP BY fare;
               ^

[SQL: SELECT embarked, AVG(fare) FROM training GROUP BY fare;]
(Background on this error at: http://sqlalche.me/e/13/f405)

You can mix fields and group functions, but you need to *GROUP BY* the field that is not a group function, embarked in this case:

In [76]:
%%sql
SELECT embarked, AVG(fare) FROM training GROUP BY embarked;

 * postgresql://tm351:***@localhost:5432/tm351
4 rows affected.

  embarked        avg
0     None  80.000000
1        C  59.954144
2        Q  13.276030
3        S  27.079812

Further exercises
=====

Some further examples of different functions.

CASTing is needed to convert the DOUBLE PRECISION types to integers

In [77]:
%%sql
SELECT pclass, ROUND(AVG(fare::integer),2) AS average_fare FROM training
GROUP BY pclass
ORDER BY average_fare DESC;

 * postgresql://tm351:***@localhost:5432/tm351
3 rows affected.

   pclass  average_fare
0       1         84.19
1       2         20.64
2       3         13.69

In [78]:
%%sql
/* you do not need to include the column you GROUPed BY, though it makes the results less meaningful */
SELECT AVG(fare) FROM testset GROUP BY embarked;

 * postgresql://tm351:***@localhost:5432/tm351
3 rows affected.

         avg
0  66.259765
1  10.957700
2  28.230436

# Summary

This notebook will have shown some of the advantages and disadvantages of using a relational database. The tables will have a fixed structure.

*Advantages*
- Each data row is predictable simplifying programming
- Data processing may be faster as no row interpretation is required
- Data updates can use the data structure to validate the update before it occurs
- Clearly defined semantics allows the DBMS to enforce data integrity
 
*Disadvantages*
- Optional data can be seen to waste space 
- Data structure must be known before the database can be built resulting in expensive modifications
- Data structure changes may impact all DB clients as they will need  updating
- The model can cause logical inconsistencies in the data representation e.g. NULLS